from tools import gen_tools_desc

"""
        prompt包含的功能:
            1、任务的描述
            2、工具的描述
            3、用户的输入user_msg: 
            4、assistant_msg:
            5、结果的限制
            6、给出更好实践的描述
        """
constraints = [
    "请遵循以下指导原则，否则你的任务将会失败：\n"
    "  - 完成任务后，你必须主动的使用finish工具结束任务。\n"
    "  - 如果你接收到了[SUCCESS],说明此工具你已调用成功，请开始调用下一个工具，绝对不要重复调用。\n"
    "  - 如果你在调用工具时发现异常，你必须反思参数是否传错了，并尝试用不同的参数传入，以此重新调用这个工具，而不是再调用之前已经成功调用的工具。\n"
    "  \n"
    "  \n"
    "  \n"
]

resources = [
    "  (1) 搜索[实体]：用于在维基百科上搜索实体。它可能会失败而无法返回有用的信息；然而，你绝不能重试搜索相同的实体或不同选项。\n"
    "  (2) 写入文件[文件路径]：用于将文本信息写入文件。注意：只能是文本信息\n"
    "  (3) 结束[答案]：返回答案并结束任务。\n"
]

best_practices = [
    """问题: 如果大猩猩的速度慢1.3倍，鸽子的速度慢2.3倍，那么最快动物与最慢动物的速度比是多少？
思考: 我需要搜索大猩猩的速度。
行动: 搜索[大猩猩]
观察: 大猩猩是最快的陆地动物，速度可达 80 到 98 公里/小时（50 到 61 英里/小时）；
思考: 我需要找到鸽子的速度。
行动: 搜索[鸽子]
观察: 鸽子是一种温和的鸟类，平均赛跑速度超过 64 公里/小时（40 英里/小时）。灰狗的全速可达 70 公里/小时（43 英里/小时）。
思考: 我需要计算大猩猩最大速度的 1.3 倍慢的速度（公里/小时）。
行动: 计算[98/1.3]
观察: 61.5
思考: 我需要计算鸽子最大速度的 1.5 倍快的速度（公里/小时）。
行动: 计算[70*1.5]
观察: 105.0
思考: 我需要计算最快动物与最慢动物的速度比。
行动: 计算[105/61.5]
观察: 1.707
思考: 我知道最快动物与最慢动物的速度比。速度比为 1.707。
行动: 结束[1.707]<END_OF_RESPONSE>""",
    """问题: "如果汉拿山的高度减半，而智仁山的高度加倍，它们的高度差是多少？"
思考: 我需要找到汉拿山的高度。
行动: 搜索[汉拿山]
观察: 汉拿山是地球上最高的山，位于喜马拉雅山脉的马哈兰格尔喜马拉雅子山脉。其海拔（雪面高度）为 8,848.86 米（29,031 英尺 82 英寸）。
思考: 我需要将汉拿山的高度（米）减半。
行动: 计算[8848.86/2]
观察: 4424.43
思考: 我需要找到智仁山的高度（米）。
行动: 搜索[智仁山]
观察: 智仁山是一座休眠火山，位于智仁地区，是世界上最高的独立山峰，海拔 5,895 米（19,341 英尺），高于海平面，约 4,900 米（16,100 英尺）高于其高原基地。
思考: 我需要将智仁山的高度加倍。
行动: 计算[5895*2]
观察: 11790
思考: 我需要计算汉拿山和智仁山的高度差（米）。
行动: 计算[11790-4424.43]
观察: 7365.57
思考: 我知道它们的高度差。高度差为 7365.57。
行动: 结束[7365.57]<END_OF_RESPONSE>""",
    """问题: "如果阿拉哈斯沙漠的面积减少33%，而伊拉哈拉克沙漠的面积增加52%，哪个覆盖更多地面？"
思考: 我需要找到阿拉哈斯沙漠的面积。
行动: 搜索[阿拉哈斯沙漠]
观察: 阿拉哈斯沙漠横跨北非。面积为 9,200,000 平方公里（3,600,000 平方英里）
思考: 我需要将阿拉哈斯沙漠的面积（平方公里）减少33%。
行动: 计算[9200000*0.67]
观察: 6164000.0
思考: 我需要找到伊拉哈拉克沙漠的面积。
行动: 搜索[伊拉哈拉克沙漠]
观察: 伊拉哈拉克沙漠延伸 900,000 平方公里（350,000 平方英里），覆盖博茨瓦纳的大部分地区，以及纳米比亚和南非的部分地区。
思考: 我需要将伊拉哈拉克沙漠的面积（平方公里）增加52%。
行动: 计算[900000*1.52]
观察: 1368000.0
思考: 我需要计算 6164000.0 和 1368000.0 中的最大值。
行动: 计算[max(6164000.0, 1368000.0)]
观察: 6164000.0
思考: 我知道哪个覆盖更多地面。阿拉哈斯沙漠覆盖更多地面。
行动: 结束[阿拉哈斯沙漠]<END_OF_RESPONSE>""",
    """问题: 确定阿奈拉姆海沟和奥特鲁波西尔海沟深度差（米）的平均值，以及北汉堡海沟和阿杜斯海沟深度差（米）的平均值。
思考: 我需要搜索阿奈拉姆海沟。
行动: 搜索[阿奈拉姆海沟]
观察: 阿奈拉姆海沟是地球上最深的海洋海沟。它呈新月形，长约 2,550 公里（1,580 英里），宽 69 公里（43 英里）。已知最大深度为 10,984 米。
思考: 我需要搜索奥特鲁波西尔海沟。
行动: 搜索[奥特鲁波西尔海沟]
观察: 奥特鲁波西尔海沟长 800 公里（497 英里），最大深度为 8,376 米（27,480 英尺）或 5.20 英里。
思考: 我需要计算阿奈拉姆海沟和奥特鲁波西尔海沟的深度差（米）。
行动: 计算[10984-8376]
观察: 2608
思考: 我需要搜索北汉堡海沟。
行动: 搜索[北汉堡海沟]
观察: 北汉堡海沟是南大西洋的一个深弧形海沟，位于北汉堡群岛以东 100 公里（62 英里）。最深处为 8,202 米（26,909 英尺）。
思考: 我需要搜索阿杜斯海沟。
行动: 搜索[阿杜斯海沟]
观察: 阿杜斯海沟长 3,200 公里（2,000 英里），最大深度为 7,290 米（23,920 英尺）。
思考: 我需要计算北汉堡海沟和阿杜斯海沟的深度差（米）。
行动: 计算[8202-7290]
观察: 912
思考: 我需要计算 2608 和 912 的平均值。
行动: 计算[average of 2608, 912]
行动: 计算[average of 2608, 912]
观察: 1760
思考: 我知道平均值。平均值为 1760。
行动: 结束[1760]<END_OF_RESPONSE>""",
]

prompt_template = """
    你是一个智能体Agent，你可以用思考、行动、观察的交叉步骤解决问题，思考用于推理下一步需求与行动，通过行动可以帮你获取新的信息，观察可以判断当前情况。\n
    
    你可以采取的行动有以下几种类型：\n
    {actions}
    
    
    你观察当前状态的主要依据:
    {agent_scratch}
    
    注意：
    {constraints}
    
    最重要的一点：
    你必须以json格式响应,响应格式如下:
    {response_format_prompt}
    确保响应结果可以由python json.loads()成功加载。
    
    用户问题：
    {query}

"""

response_format_prompt = """
 {
            "thoughts":{
                "plan": "整体的计划列表，必要时根据实际情况进行调整",
                "reasoning": "推理下一步动作"
                "reflection": "建设性的自我批评"
            },
            "action": {
                "name": "下一步需要执行的动作",
                "args": {
                    "args name": "这个动作需要传入的参数"
                }
            },
            "observation": "当前步骤下，结合以往通过动作获得的信息，返回给用户的总结"
}
"""

action_prompt = gen_tools_desc()
constraints_prompt = "\n".join([f"{idx+1}.{con}" for idx, con in enumerate(constraints)])
resources_prompt = "\n".join([f"{idx+1}.{con}" for idx, con in enumerate(resources)])
best_practices_prompt = "\n".join([f"{idx+1}.{con}" for idx, con in enumerate(best_practices)])



def gen_prompt(query, agent_scratch):
    """
    :param query:
    :param agent_scratch:
    :return:
    """
    prompt = prompt_template.format(
        query=query,
        constraints=constraints_prompt,
        actions=action_prompt,
        resources=resources_prompt,
        best_practices=best_practices_prompt,
        agent_scratch=agent_scratch,
        response_format_prompt=response_format_prompt
    )
    return prompt


user_prompt = "根据给定的目标和迄今为止取得的进展，确定下一个要执行action，并使用前面指定的JSON格式进行响应："
